test/performance-artillery/scripts/view-implementation.yml
# https://artillery.io/docs/guides/getting-started/writing-your-first-test.html#Running-a-performance-test
config:
  target: 'http://web:3000'
  http:
    timeout: 15
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    # - duration: 120
    #   arrivalRate: 5
    #   rampTo: 50
    #   name: Ramp up loadc
    # - duration: 600
    #   arrivalRate: 50
    #   name: Sustained load
scenarios:
  # - name: 'View a static page without calling kopps api'
  #   flow:
  #     - get:
  #         url: '/student/program/shb'
  # - name: 'View list of courses for ADD program, one call to kopps api'
  #   flow:
  #     - get:
  #         url: '/student/kurser/org/ADD'
  # - name: 'View programmes, on call to kopps api'
  #   flow:
  #     - get:
  #         url: '/student/kurser/kurser-inom-program'
  - name: 'View Implementation of the education'
    flow:
      - get:
          url: '/student/kurser/program/CTFYS/20192/genomforande'